/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#include "config.h"
#include "System_init.h"
#include "Task.h"

char t[] = "temperature:";

// u16 year,mounth,day;
//========================================================================
// 函数: void	main(void)
// 描述: 主函数程序.
// 参数: None.
// 返回: None.
// 版本: V1.0, 2012-10-22
//========================================================================
void main(void)
{
  EAXSFR(); /* 扩展寄存器访问使能 */
  SYS_Init();
  OLED_Init();

  while (1)
  {
    Task_Pro_Handler_Callback();

    OLED_Allfill();
    delay_ms(5);

    OLED_Clear();
    OLED_ShowNum(16, 0, 2024, 4, 16);
    OLED_ShowHanzi(50, 0, 4);
    OLED_ShowNum(66, 0, 11, 2, 16);
    OLED_ShowHanzi(82, 0, 3);
    OLED_ShowNum(98, 0, 22, 2, 16);
    OLED_ShowHanzi(114, 0, 2);
    OLED_ShowStr(0, 2, t, 16);
    OLED_ShowNum(100, 2, 26, 2, 16);
    delay_ms(255);
    delay_ms(255);
    OLED_Clear();
  }
}
